---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
source: html/28751ea7-5d5a-01a9-06a9-d895589bad07.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI

Defines parameters for general Double T shape.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralI : StructuralSectionHotRolled
```